app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "bloggy"], ["body", "BLOGGY BLOGGY BLOGGY"], ["created_at", 2017-01-13 16:54:49 UTC], ["updated_at", 2017-01-13 16:54:49 UTC], ["slug", "bloggy"]]