app/controllers/pages_controller.rb

SELECT "blogs".* FROM "blogs"
SELECT "skills".* FROM "skills"
---
  def home

    @posts = Blog.all
    @skills = Skill.all